Catalogs/упПериодыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПериодыПланирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантПредставленияПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньНеделиНачалоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньНеделиОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПлюсНачалоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПлюсОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНедельПлюсНачалоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНедельПлюсОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упПериодыПланирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция рассчитывает начало и окончание периода от точки отсчета.
//
// Параметры:
//  ПериодСсылка - СправочникСсылка.упПериодыПланирования - Ссылка на элемент справочника.
//  ТочкаОтсчета - Дата - Дата, относительно которой рассчитывается период (по умолчанию - текущая дата сеанса).
//
// Возвращаемое значение:
//   Структура   - содержит описание полученного периода:
//     * НачалоПериода    - Дата - Дата начала периода.
//     * ОкончаниеПериода - Дата - Дата окончания периода.
//
Функция РассчитатьПериодПланирования(ПериодСсылка, ТочкаОтсчета = Неопределено) Экспорт
	
	НачалоПериода    = '00010101';
	ОкончаниеПериода = '00010101';
	
	Если ТочкаОтсчета = Неопределено Тогда
		ТочкаОтсчета = ТекущаяДатаСеанса();
	КонецЕсли;
	ТочкаОтсчета = НачалоДня(ТочкаОтсчета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упПериодыПланирования.ВариантПредставленияПериода,
	|	упПериодыПланирования.ВремяНачалаПериода,
	|	упПериодыПланирования.ВремяОкончанияПериода,
	|	упПериодыПланирования.ПроизводственныйКалендарь,
	|	упПериодыПланирования.ДеньНеделиНачалоПериода,
	|	упПериодыПланирования.ДеньНеделиОкончаниеПериода,
	|	упПериодыПланирования.КоличествоДнейПлюсНачалоПериода,
	|	упПериодыПланирования.КоличествоДнейПлюсОкончаниеПериода,
	|	упПериодыПланирования.КоличествоНедельПлюсНачалоПериода,
	|	упПериодыПланирования.КоличествоНедельПлюсОкончаниеПериода
	|ИЗ
	|	Справочник.упПериодыПланирования КАК упПериодыПланирования
	|ГДЕ
	|	упПериодыПланирования.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПериодСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ВариантПредставленияПериода = 0 Тогда // дни
		НачалоПериода    = ТочкаОтсчета + Выборка.КоличествоДнейПлюсНачалоПериода*86400;
		ОкончаниеПериода = ТочкаОтсчета + Выборка.КоличествоДнейПлюсОкончаниеПериода*86400;
		
	ИначеЕсли Выборка.ВариантПредставленияПериода = 1 Тогда // рабочие дни
		МассивДней = Новый Массив;
		МассивДней.Добавить(Выборка.КоличествоДнейПлюсНачалоПериода);
		МассивДней.Добавить(Выборка.КоличествоДнейПлюсОкончаниеПериода);
		МассивДат = КалендарныеГрафики.ПолучитьМассивДатПоКалендарю(Выборка.ПроизводственныйКалендарь, ТочкаОтсчета, МассивДней);
		
		НачалоПериода = МассивДат[0];
		ОкончаниеПериода = МассивДат[1];
		
	ИначеЕсли Выборка.ВариантПредставленияПериода = 2 Тогда // дни недели
		НачалоПериода     = НачалоНедели(ТочкаОтсчета) + (Выборка.ДеньНеделиНачалоПериода - 1)*86400 + Выборка.КоличествоНедельПлюсНачалоПериода*604800;
		ОкончаниеПериода  = НачалоНедели(ТочкаОтсчета) + (Выборка.ДеньНеделиОкончаниеПериода - 1)*86400 + Выборка.КоличествоНедельПлюсОкончаниеПериода*604800;
		
	КонецЕсли;
	
	НачалоПериода    = НачалоПериода + Час(Выборка.ВремяНачалаПериода)*3600 + Минута(Выборка.ВремяНачалаПериода)*60;
	ОкончаниеПериода = ОкончаниеПериода + Час(Выборка.ВремяОкончанияПериода)*3600 + Минута(Выборка.ВремяОкончанияПериода)*60;
	
	Возврат Новый Структура("НачалоПериода, ОкончаниеПериода", НачалоПериода, ОкончаниеПериода); 
	
КонецФункции // РассчитатьПериодПланирования()

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	Для каждого текРек из Метаданные.Справочники.упПериодыПланирования.Реквизиты цикл
		Если НЕ текРек.Имя = "Комментарий" тогда
			БлокируемыеРеквизиты.Добавить(текРек.Имя);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции
	
#КонецОбласти  	

#КонецЕсли
